apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sdio_dev.h
/**************************************************************************//**
 * @file     rtl8710c_sdio_dev.h
 * @brief    The HAL related definition and macros for the SDIO device HAL driver.
 * @version  V1.00
 * @date     2017-09-07
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2016 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/


#ifndef _RTL8710C_SDIOD_H_
#define _RTL8710C_SDIOD_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup hs_hal_sdio_dev SDIO Device
* @ingroup 8710c_hal
* @{
* @brief The SDIO Device HAL module of the AmebaZ2 platform.
*/

#include "rtl8710c_sdio_dev_type.h"
#include "dlist.h"

#if !defined(container_of)
#define container_of(ptr, type, member) \
			((type *)((char *)(ptr)-(SIZE_T)(&((type *)0)->member)))
#endif

/// the Maximum size for a RX_BD can point to, it should be 4-bytes aligned
#define MAX_RX_BD_BUF_SIZE              16380

/// the minimum RX_BD is needed to send a Packet to Host, 2: one for RX_Desc, the other one for payload.
#define MIN_RX_BD_SEND_PKT              2

/**
 * @brief  Defines the bitwise flag over the RPWM2 register.
 */
enum SDIO_RPWM2_BITS {
	RPWM2_ACT_BIT           = BIT0,     ///< Active
    RPWM2_SLEEP_BIT         = 0,        ///< Sleep
    RPWM2_DSTANDBY_BIT      = BIT1,     ///< Deep Standby
    RPWM2_PG_BIT            = 0,        ///< Power Gated
    RPWM2_FBOOT_BIT         = BIT2,     ///< fast reboot
    RPWM2_NBOOT_BIT         = 0,        ///< normal reboot
    RPWM2_WKPIN_A5_BIT      = BIT3,     ///< enable GPIO A5 wakeup
    RPWM2_WKPIN_C7_BIT      = BIT4,     ///< enable GPIO C7 wakeup
    RPWM2_WKPIN_D5_BIT      = BIT5,     ///< enable GPIO D5 wakeup
    RPWM2_WKPIN_E3_BIT      = BIT6,     ///< enable GPIO E3 wakeup
    RPWM2_PIN_A5_LV_BIT     = BIT7,     ///< GPIO A5 wakeup level
    RPWM2_PIN_C7_LV_BIT     = BIT8,     ///< GPIO C7 wakeup level
    RPWM2_PIN_D5_LV_BIT     = BIT9,     ///< GPIO D5 wakeup level
    RPWM2_PIN_E3_LV_BIT     = BIT10,    ///< GPIO E3 wakeup level
    RPWM2_CG_BIT            = BIT11,    ///< Clock Gated
    RPWM2_ACK_BIT           = BIT14,    ///< Acknowledge
    RPWM2_TOGGLE_BIT        = BIT15,    ///< Toggle bit
};

/**
 * @brief  Defines the bitwise flag over the CPWM2 register.
 */
enum SDIO_CPWM2_BITS {
	CPWM2_ACT_BIT           = BIT0,     ///< Active
    CPWM2_DSTANDBY_BIT      = BIT1,     ///< Deep Standby
    CPWM2_FBOOT_BIT         = BIT2,     ///< fast reboot
    CPWM2_INIC_FW_RDY_BIT   = BIT3,     ///< is the iNIC FW(1) or Boot FW(0)

    CPWM2_TOGGLE_BIT        = BIT15,    ///< Toggle bit
};

/**
 * @brief  Defines the SDIO device HAL events.
 */
enum SDIO_EVENTS {
    SDIO_EVENT_IRQ          = BIT0,     ///< Interrupt triggered
    SDIO_EVENT_RX_PKT_RDY   = BIT1,     ///< A new SDIO packet ready
    SDIO_EVENT_C2H_DMA_DONE = BIT2,     ///< Interrupt of C2H DMA done triggered
    SDIO_EVENT_DUMP         = BIT3,     ///< SDIO status dump periodically Enable
    SDIO_EVENT_TXBD_REFILL  = BIT4,     ///< To refill TX BD buffer
    SDIO_EVENT_EXIT         = BIT28,    ///< Request to exit the SDIO task
    SDIO_EVENT_MP_STOPPED   = BIT29,    ///< The SDIO task is stopped
    SDIO_EVENT_TX_STOPPED   = BIT30,    ///< The SDIO task is stopped
    SDIO_EVENT_RX_STOPPED   = BIT31,    ///< The SDIO task is stopped
};

/**
 * @brief  Defines the packet type of a SDIO device's packet
 */
enum SDIOD_PKT_TYPE_E {
    SDIO_CMD_TX_ETH         = 0x83,    ///< request to TX a 802.3 packet
    SDIO_CMD_TX_WLN         = 0x81,    ///< request to TX a 802.11 packet
    SDIO_CMD_H2C            = 0x11,    ///< H2C(host to device) command packet
    
    SDIO_CMD_RX_ETH         = 0x82,    ///< indicate a RX 802.3 packet
    SDIO_CMD_RX_WLN         = 0x80,    ///< indicate a RX 802.11 packet
    SDIO_CMD_C2H            = 0x10     ///< C2H(device to host) command packet
};

/**
 * @brief  Defines the message type for the SDIO device HAL driver. 
 */
enum SDIOD_MSG_TYPE_E {
	MSG_SDIO_RX_PKT         = 1,		///< request to send a SDIO RX packet to the host side
	MSG_SDIO_C2H            = 2,		///< request to send a C2H message
	MSG_SDIO_RPWM           = 3,		///< request to set the RPWM
    MSG_SDIO_MP_LOOP_TXPKT  = 4,        ///< request to loopback this TX packet

	MSG_SDIO_MAX=0xff
};

/**
 * @brief  The data type of the TX BD(Buffer Descriptor).
 */
typedef struct sdiod_txbd_s {
    uint32_t    addr;               /*!< The TX buffer physical address, it must be 4-bytes aligned */
} sdiod_txbd_t, *psdiod_txbd_t;

/* The RX Buffer Descriptor format */

#if (SYSTEM_ENDIAN==PLATFORM_LITTLE_ENDIAN)
/**
 * @brief  The data type of the RX BD(Buffer Descriptor).
 */
typedef struct sdiod_rxbd_s {
    uint32_t buf_size:14;           /*!< bit[13:0], RX Buffer Size, Maximum 16384-1 */
    uint32_t ls:1;                  /*!< bit[14], is the Last Segment ? */
    uint32_t fs:1;                  /*!< bit[15], is the First Segment ? */
    uint32_t seq:16;                /*!< bit[31:16], The sequence number, it's no use for now */
    uint32_t phy_addr;              /*!< The RX buffer physical address, it must be 4-bytes aligned */
} sdiod_rxbd_t, *psdiod_rxbd_t;

/**
 * @brief  The data type of a TX packet descriptor.
 */
typedef struct sdiod_tx_desc_s {
    // DW0
    uint32_t txpktsize:16;          /*!< bit[15:0], packet size */
    uint32_t offset:8;              /*!< bit[23:16], payload start offset, normally it is sizeof(SDIO_TX_DESC) */
    uint32_t bus_agg_num:8;         /*!< bit[31:24], the bus aggregation number */

    // DW1
    uint32_t type:8;                /*!< bit[7:0], the packet type */
    uint32_t rsvd0:24;

    uint32_t rsvd1;
    uint32_t rsvd2;
    uint32_t rsvd3;
    uint32_t rsvd4;
} sdiod_tx_desc_t, *psdiod_tx_desc_t;

/**
 * @brief  The data type of a RX packet descriptor.
 */
typedef struct sdiod_rx_desc_s {
	// DW 0
	uint32_t pkt_len:16;        /*!< bit[15:0], the packet size */
	uint32_t offset:8;          /*!< bit[23:16], the offset from the packet start to the payload start,
	                                 normally it's the size of a RX Desc */
	uint32_t rsvd0:6;           /*!< bit[29:24], reserved */
	uint32_t icv:1;             // bit[30], ICV error
	uint32_t crc:1;             // bit[31], CRC error

	// DW 1
	uint32_t type:8;            // bit[7:0], the type of this packet
	uint32_t rsvd1:24;          // bit[31:8]

	// DW 2
	uint32_t rsvd2;
	uint32_t rsvd3;
	uint32_t rsvd4;
	uint32_t rsvd5;
} sdiod_rx_desc_t, *psdiod_rx_desc_t;

#else   // else of "#if (SYSTEM_ENDIAN==PLATFORM_LITTLE_ENDIAN)"
/* Structure definition with Big Endian */
/**
 * @brief  The data type of the RX BD(Buffer Descriptor).
 */
typedef struct sdiod_rxbd_s {
    uint32_t phy_addr;              /*!< The RX buffer physical address, it must be 4-bytes aligned */
    uint32_t seq:16;                /*!< bit[31:16], The sequence number, it's no use for now */
    uint32_t fs:1;                  /*!< bit[15], is the First Segment ? */
    uint32_t ls:1;                  /*!< bit[14], is the Last Segment ? */
    uint32_t buf_size:14;           /*!< bit[13:0], RX Buffer Size, Maximum 16384-1 */

